#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jharris-demo/github-actions-demo/runs/run-8hwgJtz35uVGnfRJ

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb.https-lb will be created
  + resource "aws_alb" "https-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "albdemo"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-a84da5e2",
          + "subnet-ade7b686",
          + "subnet-e23ce5bf",
          + "subnet-e8c70990",
        ]
      + tags                       = {
          + "Environment" = "demo-jharris"
          + "owner"       = "jharris@hashicorp.com"
          + "purpose"     = "demo"
          + "se-region"   = "AMER - Central E2"
          + "terraform"   = "true"
          + "ttl"         = "8"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_instance.web[0] will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0a07be880014c7b8e"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "jharris"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name"      = "demo-jharris-1"
          + "owner"     = "jharris@hashicorp.com"
          + "purpose"   = "demo"
          + "se-region" = "AMER - Central E2"
          + "terraform" = "true"
          + "ttl"       = "8"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "9c425fdbca7b57d5f23bb0a912576d95bff89ed9"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.web[1] will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0a07be880014c7b8e"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "jharris"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name"      = "demo-jharris-2"
          + "owner"     = "jharris@hashicorp.com"
          + "purpose"   = "demo"
          + "se-region" = "AMER - Central E2"
          + "terraform" = "true"
          + "ttl"       = "8"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "9c425fdbca7b57d5f23bb0a912576d95bff89ed9"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb_listener.https-lb will be created
  + resource "aws_lb_listener" "https-lb" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.app_instances will be created
  + resource "aws_lb_target_group" "app_instances" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + port                               = 80
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "owner"     = "jharris@hashicorp.com"
          + "purpose"   = "demo"
          + "se-region" = "AMER - Central E2"
          + "terraform" = "true"
          + "ttl"       = "8"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-da403da2"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.app-group[0] will be created
  + resource "aws_lb_target_group_attachment" "app-group" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.app-group[1] will be created
  + resource "aws_lb_target_group_attachment" "app-group" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_security_group.http-nginx will be created
  + resource "aws_security_group" "http-nginx" {
      + arn                    = (known after apply)
      + description            = " Allow HTTP to Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = " HTTTP from outside"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "owner"     = "jharris@hashicorp.com"
          + "purpose"   = "demo"
          + "se-region" = "AMER - Central E2"
          + "terraform" = "true"
          + "ttl"       = "8"
        }
      + vpc_id                 = "vpc-da403da2"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name             = [
      + (known after apply),
    ]
  + instance_ips             = [
      + [
          + (known after apply),
          + (known after apply),
        ],
    ]
  + instance_security_groups = [
      + [
          + (known after apply),
          + (known after apply),
        ],
    ]
  + instance_state           = [
      + [
          + (known after apply),
          + (known after apply),
        ],
    ]

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Resources: 3 of 3 estimated
           $31.176/mo +$31.176

------------------------------------------------------------------------

Organization policy check:

================ Results for policy set: policies-all-workspaces ===============

Sentinel Result: true

This result means that Sentinel policies returned true and the protected
behavior is allowed by Sentinel policies.

3 policies evaluated.

## Policy 1: policies-all-workspaces/cost-softmandatory (soft-mandatory)

Result: true

TRUE - ./cost-softmandatory.sentinel:9:1 - Rule "main"
  TRUE - ./cost-softmandatory.sentinel:11:5 - delta_monthly_cost.less_than(100)
  TRUE - ./cost-softmandatory.sentinel:11:44 - proposed_monthly_cost.less_than(250)
## Policy 2: policies-all-workspaces/cost-hardmandatory (hard-mandatory)

Result: true

TRUE - ./cost-hardmandatory.sentinel:7:1 - Rule "main"
  TRUE - ./cost-hardmandatory.sentinel:9:5 - delta_monthly_cost.less_than(150)
  TRUE - ./cost-hardmandatory.sentinel:9:44 - proposed_monthly_cost.less_than(500)
## Policy 3: policies-all-workspaces/tags-advisory (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to require that all EC2 instances  have all mandatory tags.

TRUE - ./tags-advisory.sentinel:121:1 - Rule "main"


```

</details>

*Pusher: @jonharrisnm, Action: `pull_request`*